{
  "books": [
    {
      "slug": "wanikani",
      "title": "WaniKani",
      "author": "Heinrich Böll",
      "blurb": "WaniKani is an online tool designed to help learners master over 2,000 kanji and 6,000 vocabulary words using a spaced repetition system. It focuses on efficient memorization through mnemonic aids and timed reviews that reinforce long-term retention. Best suited for learners who want to build strong reading skills, WaniKani is a powerful supplement to any Japanese study routine.",
      "img": "wanikani.jpg"
    },
    {
      "slug": "genki",
      "title": "Genki",
      "author": "Annie Proulx",
      "blurb": "Genki, An Integrated Course in Elementary Japanese, is a highly recommended textbook for beginners learning Japanese. It offers a clear, structured approach with engaging dialogues, grammar explanations, and practice exercises that build foundational skills. Ideal for both classroom and self-study, it also incorporates cultural context to enhance language learning.",
      "img": "genki.jpg"
    },
    {
      "slug": "anki",
      "title": "Anki",
      "author": "Leonora Carrington",
      "blurb": "Anki is a customizable flashcard app that uses spaced repetition to help learners efficiently memorize and retain information, including Japanese vocabulary, kanji, and grammar. Its flexibility allows users to download pre-made decks or create their own tailored to specific learning goals. Anki is especially popular among serious language learners for its effectiveness in long-term retention and daily review.",
      "img": "anki.jpg"
    }
  ],
  "example_multigraph": [
    {
      "name": "Matt’s El Rancho",
      "address": "2613 S Lamar Blvd, Austin, TX 78704",
      "description": [
        {
          "type": "text",
          "value": "Matt Martinez started his career in 1923 at the age of six selling tamales from a wooden pushcart by the Texas Capitol."
        },
        {
          "type": "text",
          "value": "Matt & Janie opened El Rancho in 1952 on East 1st Street in downtown Austin with no employees and seating for 40.   Matt worked the front of the house and Janie made everything from scratch in the kitchen."
        },
        {
          "type": "text",
          "value": "Today the South Lamar restaurant seats more than 500.  El Rancho still makes everything from scratch.  Our in house tortilla factory grinds Non-GMO corn daily to make the freshest corn tortillas and chips you can find.   Our famous Margarita’s are made with fresh squeezed lime juice."
        }
      ]
    }
  ],
  "example_prose": [
    {
      "type": "text",
      "value": "This is the first paragraph of a multi-paragraph intro formatted in a Google Doc to be used for <a href=\"http://archieml.org/#demo\">ArchieML</a> that includes . What is said here is not that important, but the structure of this text in the Google Doc is."
    },
    {
      "type": "subhead",
      "value": "This is subhead"
    },
    {
      "type": "text",
      "value": "This is the second paragraph of the text to show how to loop over the text."
    },
    {
      "type": "text",
      "value": "# this is a list embedded in the text"
    },
    {
      "type": "list",
      "value": [
        {
          "type": "text",
          "value": "First list item."
        },
        {
          "type": "text",
          "value": "Second list item."
        }
      ]
    }
  ],
  "example_image": [
    {
      "type": "text",
      "value": "This is another freeform array of text with multiple paragraphs but in this case there is an image call between two paragraphs of the text."
    },
    {
      "type": "img",
      "value": {
        "filename": "the-clown.jpg",
        "alt": "the clown"
      }
    },
    {
      "type": "text",
      "value": "This is the second graph of text. The image above will be placed between the two graphs using an image macro in the processors.njk file."
    }
  ]
}
